sdaiGetSchemaInstance(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,Sdai_instS*)
\details
Retrieves a schema instance with a specified name from a specified repository.
\param schemaInstanceName [in] A string that contains the schema instance name.
\param repository         [in] A repository where the function searches for the schema instance by its name.
\returns The schema instance with the specified name.